<?php
/************************************************|
|* Description | Language file - RUSSIAN         *|
|************************************************/

    /* General */
 define('LANG', array(
    "username_or_password_is_invalid" => "Ваше имя пользователя или пароль недействительны.",
    "login_btn" => "Войти",

    // Hello.tpl
    "hello" => "Привет, мир!",
    "hello_installation_successful" => "Установка NoobMVC успешно завершена!",
    "hello_message" => 
            "<p>Это стандартное представление для контроллера Hello. Вы можете найти его в файле Views/Hello.tpl.
            Для получения дополнительной информации о использовании NoobMVC посетите <a href='https://github.com/kurzejapatryk/NoobMVC/wiki'>сайт NoobMVC на Github</a>.</p>
            <p>Теперь создайте свои собственные контроллеры и представления!</p>",
    
    /* Months */
    "months" => [
        '01' => "Январь",
        '02' => "Февраль",
        '03' => "Март",
        '04' => "Апрель",
        '05' => "Май",
        '06' => "Июнь",
        '07' => "Июль",
        '08' => "Август",
        '09' => "Сентябрь",
        '10' => "Октябрь",
        '11' => "Ноябрь",
        '12' => "Декабрь",
        /* Abbreviated months */
        "Jan" => "ЯНВ",
        "Feb" => "ФЕВ",
        "Mar" => "МАР",
        "Apr" => "АПР",
        "May" => "МАЙ",
        "Jun" => "ИЮН",
        "Jul" => "ИЮЛ",
        "Aug" => "АВГ",
        "Sep" => "СЕН",
        "Oct" => "ОКТ",
        "Nov" => "НОЯ",
        "Dec" => "ДЕК",
    ],


    /* Validation errors */
    "val_errors" => [
        "val_pattern" => "Неверный формат данных.",
        "val_required" => "Это поле обязательно для заполнения.",
        "val_min" => "Значение слишком мало.",
        "val_max" => "Значение слишком велико.",
        "val_equal" => "Значение должно быть равно ",
        "val_file_max_size" => "Файл слишком большой.",
        "val_file_ext" => "Неверный формат файла.",
    ],

    /* Error pages */
    "404" => "Эта страница не существует",
    "500" => "Внутренняя ошибка сервера"

));
